### Latihan Praktikum 1

In [1]:
from pyspark.sql import SparkSession

In [3]:
spark = SparkSession.builder.appName("SparkSQL").getOrCreate()

In [4]:
df = spark.read.csv("employee.csv",header=True,inferSchema=True)

In [6]:
df.show() # Mencoba untuk menampilkan data default

+-----------+-------------+---+----------+-----+
|employee_id|employee_name|age|  location|hours|
+-----------+-------------+---+----------+-----+
|       G001|       Pichai| 47|California|   14|
|       M002|         Bill| 64|Washington|   10|
|       A003|         Jeff| 56|Washington|   11|
|       A004|         Cook| 59|California|   12|
+-----------+-------------+---+----------+-----+

In [7]:
#Membuat sebuah view dengan nama `associates`
df.createOrReplaceTempView("associates")

In [8]:
# Menggunakan perintah select pada associates
sql_result_1 = spark.sql("SELECT * FROM associates")

In [9]:
print("Showing the results of the select query")
sql_result_1.show()

Showing the results of the select query
+-----------+-------------+---+----------+-----+
|employee_id|employee_name|age|  location|hours|
+-----------+-------------+---+----------+-----+
|       G001|       Pichai| 47|California|   14|
|       M002|         Bill| 64|Washington|   10|
|       A003|         Jeff| 56|Washington|   11|
|       A004|         Cook| 59|California|   12|
+-----------+-------------+---+----------+-----+

In [10]:
sql_result_2 = spark.sql("SELECT * FROM associates WHERE age BETWEEN 45 AND 60 AND location='California'")

In [11]:
print("Showing the results after using Where clause in select query")
sql_result_2.show()

Showing the results after using Where clause in select query
+-----------+-------------+---+----------+-----+
|employee_id|employee_name|age|  location|hours|
+-----------+-------------+---+----------+-----+
|       G001|       Pichai| 47|California|   14|
|       A004|         Cook| 59|California|   12|
+-----------+-------------+---+----------+-----+